In [354]:
import json
import pandas as pd
import numpy as np
from pprint import pprint
import datetime

import re
from ast import literal_eval

from sqlalchemy import create_engine
import psycopg2

import time

from config import db_password

In [336]:
file_dir = "Resources"
# Observation data
weather_file = f'../{file_dir}/example_data.json'

#Parameter File
params_file = f'../{file_dir}/params_list.json'

In [337]:

# Open the read the Observation data JSON file.
with open(f'{weather_file}', mode='r') as file:
    weather_raw = json.load(file)  # Load the file into a list of Dictionaries NOT RIGHT TO JSON

with open(f'{params_file}', mode='r') as file:
    params_data = json.load(file)  # Load the file into a list of Dictionaries NOT RIGHT TO JSON

In [338]:
weather_df = pd.DataFrame(weather_raw)

In [339]:
weather_df.head()

                                                data
0  {'meta': {'valid_daterange': [['1893-01-01', '...
1  {'meta': {'valid_daterange': [[], [], ['1990-0...
2  {'meta': {'valid_daterange': [['1943-05-01', '...
3  {'meta': {'valid_daterange': [['1892-04-25', '...
4  {'meta': {'valid_daterange': [['2002-09-01', '...

In [340]:
params_df = pd.DataFrame(params_data)

In [341]:
params_df.head()

,counties,sdate,edate,meta,elems,output,url
0,"27053,27037,27019,27139,27123,27163,27003",2002-01-01,2022-05-16,"name,state,sids,sid_dates,ll,elev,uid,county,c...","maxt,mint,pcpn,snow,snwd,avgt",json,http://data.rcc-acis.org/MultiStnData?county=2...

In [342]:
params_df.dtypes

counties    object
sdate       object
edate       object
meta        object
elems       object
output      object
url         object
dtype: object

In [343]:
counter = 0
stations_list =[]
observations_list = []
# Convert the start/end date
startDate = pd.to_datetime(params_df['sdate'][0])
endDate = pd.to_datetime(params_df['edate'][0])

for observation in weather_raw['data']:
    #stations_df.append(observation["meta"]["name"])
    # Create a list of 
    stations_list.append(observation["meta"])
        

    currentDate = startDate
    
    for observation_data in observation["data"]:
        observations_list.append({"station_uid":observation["meta"]["uid"],"date":currentDate, "data":observation_data})
        currentDate = currentDate + datetime.timedelta(days=1)
        counter = counter + 1

stations_df = pd.DataFrame(stations_list)
observations_df = pd.DataFrame(observations_list)

In [344]:
observations_df.head()

   station_uid       date                data
0        10373 2002-01-01  [M, M, M, M, M, M]
1        10373 2002-01-02  [M, M, M, M, M, M]
2        10373 2002-01-03  [M, M, M, M, M, M]
3        10373 2002-01-04  [M, M, M, M, M, M]
4        10373 2002-01-05  [M, M, M, M, M, M]

In [345]:
stations_df.head()

,valid_daterange,name,ll,sids,county,state,elev,climdiv,uid,sid_dates
0,"[[1893-01-01, 1893-05-31], [1893-01-01, 1893-0...",NORTHFIELD 2NNE,"[-93.1486, 44.4753]","[215987 2, USC00215987 6, NFDM5 7, NRFM5 7]",27037,MN,890.0,MN08,10373,"[[215987 2, 1941-12-02, 9999-12-31], [215987 2..."
1,"[[], [], [1990-04-01, 2015-07-18], [1990-04-01...",ST FRANCIS,"[-93.3591, 45.3878]","[217309 2, USC00217309 6, SFSM5 7]",27003,MN,900.0,MN06,10674,"[[217309 2, 1990-03-01, 2013-09-01], [USC00217..."
2,"[[1943-05-01, 2022-05-17], [1943-02-06, 2022-0...",ROSEMOUNT RESEARCH AND OUTREACH CENTER,"[-93.09798, 44.71673]","[217107 2, USC00217107 6, RSMM5 7]",27037,MN,945.0,MN09,10395,"[[217107 2, 1950-12-01, 9999-12-31], [217107 2..."
3,"[[1892-04-25, 2022-05-16], [1892-04-26, 2022-0...",FARMINGTON 3NW,"[-93.17559, 44.666]","[212737 2, USC00212737 6, FRMM5 7]",27037,MN,960.0,MN09,10392,"[[212737 2, 2020-11-18, 9999-12-31], [212737 2..."
4,"[[2002-09-01, 2013-04-28], [2002-09-01, 2013-0...",SPRING PARK,"[-93.6275, 44.9346]","[217935 2, USC00217935 6, SPKM5 7]",27053,MN,1016.0,MN06,31444,"[[217935 2, 2000-07-25, 2013-05-01], [USC00217..."

In [346]:
# split the ll list into Latitude and longitude 
split_df = pd.DataFrame(stations_df['ll'].to_list(), columns = ['latitude','longitude'])
# concat df and split_df
stations_df = pd.concat([stations_df, split_df], axis=1)
# Drop ll column.
stations_df = stations_df.drop(columns=["ll"])
# display df
stations_df.head()

,valid_daterange,name,sids,county,state,elev,climdiv,uid,sid_dates,latitude,longitude
0,"[[1893-01-01, 1893-05-31], [1893-01-01, 1893-0...",NORTHFIELD 2NNE,"[215987 2, USC00215987 6, NFDM5 7, NRFM5 7]",27037,MN,890.0,MN08,10373,"[[215987 2, 1941-12-02, 9999-12-31], [215987 2...",-93.14860,44.47530
1,"[[], [], [1990-04-01, 2015-07-18], [1990-04-01...",ST FRANCIS,"[217309 2, USC00217309 6, SFSM5 7]",27003,MN,900.0,MN06,10674,"[[217309 2, 1990-03-01, 2013-09-01], [USC00217...",-93.35910,45.38780
2,"[[1943-05-01, 2022-05-17], [1943-02-06, 2022-0...",ROSEMOUNT RESEARCH AND OUTREACH CENTER,"[217107 2, USC00217107 6, RSMM5 7]",27037,MN,945.0,MN09,10395,"[[217107 2, 1950-12-01, 9999-12-31], [217107 2...",-93.09798,44.71673
3,"[[1892-04-25, 2022-05-16], [1892-04-26, 2022-0...",FARMINGTON 3NW,"[212737 2, USC00212737 6, FRMM5 7]",27037,MN,960.0,MN09,10392,"[[212737 2, 2020-11-18, 9999-12-31], [212737 2...",-93.17559,44.66600
4,"[[2002-09-01, 2013-04-28], [2002-09-01, 2013-0...",SPRING PARK,"[217935 2, USC00217935 6, SPKM5 7]",27053,MN,1016.0,MN06,31444,"[[217935 2, 2000-07-25, 2013-05-01], [USC00217...",-93.62750,44.93460

In [347]:
# create sids columns for the array sids
sids = []
sid_string = ""
counter = 1
for x in range(stations_df.sids.map(len).max()):
  sids.append(f"sid_{counter}")
  sid_string = f"{sid_string}, 'sid_{counter}'"
  counter = counter + 1

# split the array into separate columns
split_df = pd.DataFrame(stations_df['sids'].to_list(), columns = sids)

# concat df and split_df
stations_df = pd.concat([stations_df, split_df], axis=1)

# Drop names from columns.
stations_df = stations_df.drop(columns=["sids"])

stations_df.head(1)

,valid_daterange,name,county,state,elev,climdiv,uid,sid_dates,latitude,longitude,sid_1,sid_2,sid_3,sid_4,sid_5,sid_6,sid_7,sid_8
0,"[[1893-01-01, 1893-05-31], [1893-01-01, 1893-0...",NORTHFIELD 2NNE,27037,MN,890.0,MN08,10373,"[[215987 2, 1941-12-02, 9999-12-31], [215987 2...",-93.1486,44.4753,215987 2,USC00215987 6,NFDM5 7,NRFM5 7,None,None,None,None

In [356]:
# Reorder columns in the DF - Remove the valid_daterange and sid_dates since they are not necessary
column_list = f"['uid','name','county','state','latitude','longitude','climdiv'{sid_string}]"  #'valid_daterange','sid_dates'

# change the string into an array for the reordering
columnArray = literal_eval(column_list)

stations_df_reordered = stations_df.loc[:, columnArray]

In [358]:
stations_df_reordered.head()

,uid,name,county,state,latitude,longitude,climdiv,sid_1,sid_2,sid_3,sid_4,sid_5,sid_6,sid_7,sid_8
0,10373,NORTHFIELD 2NNE,27037,MN,-93.14860,44.47530,MN08,215987 2,USC00215987 6,NFDM5 7,NRFM5 7,None,None,None,None
1,10674,ST FRANCIS,27003,MN,-93.35910,45.38780,MN06,217309 2,USC00217309 6,SFSM5 7,None,None,None,None,None
2,10395,ROSEMOUNT RESEARCH AND OUTREACH CENTER,27037,MN,-93.09798,44.71673,MN09,217107 2,USC00217107 6,RSMM5 7,None,None,None,None,None
3,10392,FARMINGTON 3NW,27037,MN,-93.17559,44.66600,MN09,212737 2,USC00212737 6,FRMM5 7,None,None,None,None,None
4,31444,SPRING PARK,27053,MN,-93.62750,44.93460,MN06,217935 2,USC00217935 6,SPKM5 7,None,None,None,None,None

In [350]:
# Separate the data columns into the elems requested
# create sids columns for the array sids
elems = str(params_df["elems"][0])

elems = elems.replace(",","','")

# convert the elems from the params list to a string for splitting apart the Array 
column_list = f"['{elems}']"
columnArray = literal_eval(column_list)

# split the array into separate columns]
split_df = pd.DataFrame(observations_df['data'].to_list(), columns = columnArray)

In [351]:
# split up the data returned based on the Elements stored in the params json file

# concat df and split_df
observations_df = pd.concat([observations_df, split_df], axis=1)
# Drop data column.
observations_df = observations_df.drop(columns=["data"])
# display df
observations_df.head()

   station_uid       date maxt mint pcpn snow snwd avgt
0        10373 2002-01-01    M    M    M    M    M    M
1        10373 2002-01-02    M    M    M    M    M    M
2        10373 2002-01-03    M    M    M    M    M    M
3        10373 2002-01-04    M    M    M    M    M    M
4        10373 2002-01-05    M    M    M    M    M    M

In [359]:
    # Connect to PostgreSQL movie_data DB
    db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/last_freeze_analysis"

    # Create the database engine with the following line 
    engine = create_engine(db_string)

    # Save the stations DataFrame to a SQL table "stations"- Replace the table if it already exists
    stations_df_reordered.to_sql(name='stations', con=engine, if_exists='replace')   

    # Save the observations DataFrame to a SQL table "observations"- Replace the table if it already exists
    observations_df.to_sql(name='observations', con=engine, if_exists='replace')